

drop table if exists "Поставщики S" cascade;

create table public."Поставщики S"(
"П#" varchar(64) primary key,
"Имя П" varchar(64),
"Статус" integer,
"Город" varchar(64)
);
drop table if exists "Детали P" cascade;

create table public."Детали P"(
"Д#" varchar(64) primary key,
"Имя Д" varchar(64),
"Цвет" varchar(64),
"Размер" integer,
"Город" varchar(64)
);

drop table if exists "Проекты J" cascade;

create table public."Проекты J"(
"ПР#" varchar(64) primary key,
"Имя ПР" varchar(64),
"Город" varchar(64)
);
drop table if exists "Поставки SPJ" cascade;

create table public."Поставки SPJ"(
    "П#" varchar(64) references "Поставщики S"("П#"),
    "Д#" varchar(64) references "Детали P"("Д#"),
    "ПР#" varchar(64) references "Проекты J"("ПР#"),
    "S" integer
);

INSERT INTO "Поставщики S" ("П#", "Имя П", "Статус", "Город") 
VALUES ('П1', 'Петров', '20', 'Москва'), 
('П2', 'Синицин', '10', 'Лондон'), 
('П3', 'Федоров', '30', 'Таллинн'), 
('П4', 'Чаянов', '20', 'Минск'),
('П5', 'Крюков', '30', 'Киев');


INSERT INTO "Детали P" ("Д#", "Имя Д", "Цвет", "Размер", "Город") 
VALUES ('Д1', 'Болт', 'Красный', '12', 'Москва'), 
('Д2', 'Гайка', 'Зеленая', '17', 'Минск'), 
('Д3', 'Диск', 'Черный', '17', 'Вильнюс'), 
('Д4', 'Диск', 'Черный', '14', 'Москва'), 
('Д5', 'Корпус', 'Красный', '12', 'Минск'),
('Д6', 'Крышки', 'Красный', '19', 'Москва');


INSERT INTO "Проекты J" ("ПР#", "Имя ПР", "Город") 
VALUES ('ПР1', 'ИПР1', 'Минск'), ('ПР2', 'ИПР2', 'Таллинн'), 
('ПР3', 'ИПР3', 'Псков'), ('ПР4', 'ИПР4', 'Псков'),
('ПР5', 'ИПР4', 'Москва'), ('ПР6', 'ИПР6', 'Саратов'),
('ПР7', 'ИПР7', 'Москва'), ('ПР8', 'ИПР8', 'Лондон');

INSERT INTO "Поставки SPJ" ("П#", "Д#", "ПР#", "S") 
VALUES ('П1', 'Д1', 'ПР1', '200'), ('П1', 'Д1', 'ПР2', '700'), 
('П1', 'Д1', 'ПР5', '100'), ('П1', 'Д1', 'ПР8', '200'), 
('П1', 'Д3', 'ПР8', '1000'), ('П2', 'Д2', 'ПР2', '200'), 
('П2', 'Д3', 'ПР1', '400'), ('П2', 'Д3', 'ПР3', '200'), 
('П2', 'Д3', 'ПР4', '500'), ('П2', 'Д3', 'ПР5', '600'), 
('П2', 'Д3', 'ПР6', '400'), ('П2', 'Д3', 'ПР7', '800'), 
('П2', 'Д5', 'ПР2', '100'), ('П3', 'Д3', 'ПР1', '200'), 
('П3', 'Д4', 'ПР2', '500'), ('П4', 'Д6', 'ПР3', '300'), 
('П4', 'Д6', 'ПР7', '300'), ('П5', 'Д1', 'ПР2', '100'), 
('П5', 'Д2', 'ПР2', '200'), ('П5', 'Д2', 'ПР4', '100'), 
('П5', 'Д3', 'ПР4', '200'), ('П5', 'Д4', 'ПР4', '800'), 
('П5', 'Д5', 'ПР4', '400'), ('П5', 'Д5', 'ПР5', '500'), 
('П5', 'Д5', 'ПР7', '100'), ('П5', 'Д6', 'ПР2', '200'), 
('П5', 'Д6', 'ПР4', '500');